{
  "id_to_token": [
    "<pad>",
    "<bos>",
    "<sep>",
    "<unk>",
    "O-O",
    "Nf3",
    "Nf6",
    "d4",
    "e4",
    "Nc3",
    "d5",
    "c5",
    "e5",
    "c4",
    "Nc6",
    "e6",
    "d6",
    "g6",
    "a6",
    "Be7",
    "b5",
    "cxd4",
    "Be3",
    "g3",
    "Bd3",
    "a4",
    "h6",
    "a5",
    "f4",
    "h3",
    "c6",
    "Bg7",
    "b4",
    "f5",
    "Nxd4",
    "c3",
    "h4",
    "exd5",
    "e3",
    "a3",
    "h5",
    "Be2",
    "Bg5",
    "cxd5",
    "Ne5",
    "Re1",
    "Qc7",
    "b3",
    "b6",
    "Nd7",
    "Bg2",
    "g4",
    "Ne4",
    "Re8",
    "Qd2",
    "Bf4",
    "Bb7",
    "Nd5",
    "Qc2",
    "Be6",
    "Bd7",
    "g5",
    "Qe2",
    "Rc8",
    "f3",
    "Bd6",
    "Nbd7",
    "Bc4",
    "Nd2",
    "d3",
    "Rc1",
    "Bd2",
    "Bf5",
    "Nxd5",
    "f6",
    "Qe7",
    "Nxe4",
    "Bb5",
    "Nd4",
    "Bg4",
    "Nc5",
    "Qb6",
    "Rb8",
    "Rd1",
    "Nxe5",
    "dxe5",
    "Bc5",
    "Kg7",
    "Rd8",
    "Qd7",
    "Bb4",
    "Nc4",
    "O-O-O",
    "exd4",
    "Nbd2",
    "Ne2",
    "Kg2",
    "Ne7",
    "Bb2",
    "Qb3",
    "Bxf6",
    "Nb6",
    "Qd3",
    "Rb1",
    "Kf7",
    "Kf2",
    "dxe4",
    "dxc4",
    "Bb3",
    "dxc5",
    "Nb3",
    "Qf3",
    "Nf5",
    "Ke7",
    "Kf8",
    "Nf4",
    "Rad1",
    "bxc3",
    "Kh8",
    "Kh2",
    "Qa5",
    "Rd2",
    "Kh1",
    "Bxf3",
    "Kh7",
    "Bxd5",
    "Rd7",
    "Ng5",
    "Ng3",
    "Bf6",
    "Qf6",
    "Ke2",
    "Qd6",
    "Qe3",
    "Rc7",
    "Ng4",
    "Kf1",
    "Ne3",
    "Kf6",
    "Bc6",
    "bxc6",
    "Nd3",
    "Na5",
    "Nh5",
    "Bxe4",
    "Bc2",
    "Nb5",
    "axb5",
    "Qxd4",
    "Bxc4",
    "Bxe5",
    "Bf3",
    "Ne6",
    "Nd6",
    "Bxd4",
    "Rc2",
    "Bd4",
    "Ng6",
    "Kf3",
    "Ra8",
    "Bxc6",
    "Bf8",
    "Nb4",
    "Bg3",
    "Ke3",
    "Be4",
    "Rfd1",
    "Kg8",
    "Nxc6",
    "Qxd5",
    "Bxc5",
    "Rac1",
    "Qd8",
    "Rad8",
    "Re2",
    "Ba6",
    "Rac8",
    "Bd5",
    "Ke6",
    "Na4",
    "Bh4",
    "axb4",
    "Rf8",
    "Be5",
    "Re7",
    "Bg6",
    "Rfd8",
    "Bb6",
    "Rd3",
    "Nxc3",
    "Ra1",
    "Bc3",
    "Rfe1",
    "Bxc3",
    "Rf1",
    "Ba4",
    "Kg3",
    "Kg6",
    "fxe5",
    "Qg4",
    "Nh4",
    "Bh6",
    "Kg1",
    "Na6",
    "Bf1",
    "Qg3",
    "Kd7",
    "Ra7",
    "Re3",
    "Qc3",
    "Qc6",
    "exf5",
    "Kd2",
    "Rfe8",
    "Qf4",
    "Kd3",
    "Kb1",
    "Qe6",
    "Qa4",
    "Qd4",
    "Rd6",
    "Nc7",
    "bxc4",
    "Kd6",
    "Rg8",
    "Rc6",
    "Rc3",
    "fxe4",
    "Qg5",
    "Qc8",
    "Rg1",
    "Qh4",
    "Rd4",
    "Qd5",
    "Nxc5",
    "Qc5",
    "Qf2",
    "Rb7",
    "Qh5",
    "Nf1",
    "Rf7",
    "Rc5",
    "Qe4",
    "Rd5",
    "Rc4",
    "hxg5",
    "Qxd6",
    "fxe6",
    "bxc5",
    "Ne8",
    "Qb7",
    "Qf5",
    "Ra2",
    "Nf8",
    "Qb4",
    "Qxc4",
    "Ba3",
    "Qe8",
    "Qd1",
    "Qe5",
    "Re6",
    "Qxd3",
    "Qc4",
    "Nxc4",
    "exf6",
    "exf4",
    "Ke5",
    "Bxf5",
    "gxf5",
    "Bxd6",
    "Bh5",
    "Rxd5",
    "Bc8",
    "Bxf4",
    "Ra6",
    "Ra3",
    "Na3",
    "gxf6",
    "hxg4",
    "Rf2",
    "Rxd4",
    "Bxd3",
    "Qb5",
    "Rb6",
    "Nc2",
    "hxg6",
    "Bf2",
    "axb3",
    "Kf4",
    "Qxe4",
    "Qg6",
    "Kf5",
    "Rf3",
    "Qe1",
    "Qf7",
    "Qxf6",
    "Bh3",
    "Ke4",
    "Bc7",
    "Re5",
    "Rb3",
    "Qxf3",
    "Rb4",
    "Nge2",
    "Rb2",
    "Qc1",
    "Rxe5",
    "Ra4",
    "Qxe5",
    "Rh8",
    "Kc7",
    "Rf6",
    "Ra5",
    "Re4",
    "Kd4",
    "Bxe6",
    "Kc2",
    "Bb4+",
    "dxc6",
    "gxf4",
    "Rxd8",
    "Rfc8",
    "Rb5",
    "Qxc5",
    "Bc1",
    "Ke8",
    "Qb8",
    "Rxe4",
    "Kc6",
    "Bb5+",
    "Nge7",
    "Kd5",
    "Ne1",
    "cxb5",
    "Qb2",
    "Kc3",
    "Rh1",
    "Rae1",
    "Qxc3",
    "Kg5",
    "Rxd6",
    "Rxd1",
    "Bxe7",
    "Nfd7",
    "Rf4",
    "hxg3",
    "Qxe7",
    "Kg4",
    "Rxc5",
    "Rxc4",
    "Nxe6",
    "axb6",
    "Rg3",
    "gxf3",
    "Bxg7",
    "Qa6",
    "Nxf6",
    "Rab8",
    "Bd8",
    "Kxg7",
    "Qa3",
    "Rae8",
    "Rxc3",
    "cxb4",
    "Kc5",
    "Nxd7",
    "Bxg5",
    "Nxf6+",
    "Kc4",
    "Rh3",
    "Rab1",
    "Nxe3",
    "Rfc1",
    "Bxe3",
    "Rf5",
    "Rxc8",
    "fxe3",
    "Kh6",
    "Nxf4",
    "Qxc6",
    "Be8",
    "Rxe6",
    "Nb8",
    "Kh3",
    "Kb8",
    "Rxc1",
    "Rxc6",
    "Bxb5",
    "Ke1",
    "Nh6",
    "Qxd2",
    "Qxd7",
    "Qh3",
    "Bf7",
    "Rxd3",
    "Bb1",
    "Qxf4",
    "Nxf5",
    "Rg6",
    "Kd8",
    "Ba5",
    "Bxc3+",
    "Bd1",
    "Rxb7",
    "Kb2",
    "Qb1",
    "Rxd7",
    "exd6",
    "Nxb5",
    "Be1",
    "Rh4",
    "Rxe3",
    "Rxb2",
    "Qxb2",
    "Qh6",
    "Nxd2",
    "Bxg2",
    "gxh5",
    "Nxd6",
    "fxg6",
    "Nf7",
    "Nxd3",
    "Bxb4",
    "Rxa4",
    "Qxe3",
    "Qxb6",
    "Bxa6",
    "Qa7",
    "Rxd2",
    "Rxa5",
    "Rh5",
    "bxa4",
    "Rxf5",
    "Bxg4",
    "Kb6",
    "Qxf5",
    "Rxe7",
    "Rxc2",
    "Nh3",
    "cxd6",
    "Kb7",
    "Ba7",
    "Kb3",
    "Rg7",
    "Bxe2",
    "Rxe8",
    "Rxf6",
    "Rg4",
    "Rh6",
    "fxg5",
    "Nh7",
    "Qxb7",
    "Nf2",
    "Rxf4",
    "Kxg2",
    "Kd1",
    "Ngf6",
    "Rg5",
    "Bxd7",
    "Rxc7",
    "Nxb3",
    "fxg4",
    "Nd1",
    "Ngf3",
    "Qxb4",
    "Rxa6",
    "Rxe1",
    "Rg2",
    "Rh2",
    "Qxe2",
    "Rxa7",
    "Nxg5",
    "Nxb4",
    "Rxf7",
    "Rxb4",
    "Kb5",
    "Bxb7",
    "Qf8",
    "Qxb3",
    "Nh2",
    "bxa5",
    "Ba2",
    "Nxg6",
    "Kb4",
    "Nc8",
    "Rhe1",
    "Rh7",
    "dxc3",
    "Rxa2",
    "Rxf3",
    "Qg7",
    "Qxb5",
    "Qxg5",
    "Qxe6",
    "Rxb5",
    "Bxh6",
    "Qa4+",
    "Nd8",
    "Nxb6",
    "dxe6",
    "cxd3",
    "fxg3",
    "Qg2",
    "Ng7",
    "Bxb2",
    "Kc1",
    "Nxg4",
    "Nb1",
    "cxb3",
    "Rxa8",
    "Nxf3",
    "Nxg3",
    "Nc1",
    "Rxb6",
    "Rxf2",
    "Rxb3",
    "Bxd2",
    "Rxe2",
    "Kc8",
    "Nxf3+",
    "Red1",
    "Qa5+",
    "Rxa1",
    "Kh4",
    "Ng8",
    "Qxg4",
    "Rxa3",
    "Qxa5",
    "Bxg6",
    "gxh4",
    "Bxb3",
    "Nb7",
    "Qa2",
    "Rd1+",
    "Bxb6",
    "exf3",
    "Kxf7",
    "Bxd7+",
    "Rxd8+",
    "Re1+",
    "Re8+",
    "Qxa4",
    "Rd8+",
    "Bh2",
    "Nxa4",
    "Qd4+",
    "Bh7",
    "Rxd1+",
    "Qxc7",
    "Qxd1",
    "Qa8",
    "Qxd8",
    "Kh5",
    "Rxh5",
    "Qxa6",
    "Qxc2",
    "Qf1",
    "Nb2",
    "Qe5+",
    "Bxg3",
    "Nf6+",
    "Rxe1+",
    "Rxe8+",
    "Bb8",
    "Bxa4",
    "Bxd2+",
    "cxb6",
    "Bxf8",
    "Qxh5",
    "Qe4+",
    "Qd5+",
    "Bxa3",
    "Rcd1",
    "bxa3",
    "Red8",
    "Qxa2",
    "Qa1",
    "Ka2",
    "Nxa5",
    "bxa6",
    "Bxf1",
    "Nxe7",
    "Qxa7",
    "Rc8+",
    "Rde1",
    "Qh5+",
    "Nd6+",
    "Nxf7",
    "Rxh4",
    "Bxc8",
    "Bxh3",
    "Qxd8+",
    "gxh6",
    "Rfb8",
    "Rcd8",
    "Nxa6",
    "Ng2",
    "Rxb8",
    "Ndb5",
    "Qxh4",
    "Kxf2",
    "Nxh5",
    "Qe6+",
    "Na2",
    "Kxd8",
    "Rhd1",
    "Rxg5",
    "Na7",
    "Qg4+",
    "Rxf8",
    "Nfd2",
    "Rc1+",
    "Rxh6",
    "Bxh4",
    "Rxb1",
    "Qh4+",
    "Rxg4",
    "Ba8",
    "Qf4+",
    "Qg5+",
    "Rd7+",
    "Bxc6+",
    "Nxb7",
    "Rxg6",
    "Nxe7+",
    "Qb6+",
    "Qxa3",
    "Rd2+",
    "Kxf1",
    "Bxd8",
    "Qxg3",
    "Qxh6",
    "Nxb2",
    "Ndf6",
    "Rxf1",
    "Ka7",
    "Qe3+",
    "Qf5+",
    "Nce2",
    "Bxa5",
    "Bxc7",
    "Bxc1",
    "Rxg7",
    "Kxf8",
    "Kxf6",
    "Ka1",
    "Bxa8",
    "Rf1+",
    "d7",
    "Nf3+",
    "Nxe2",
    "Nxh4",
    "Ndf3",
    "Bxd1",
    "Bxa7",
    "Rc7+",
    "a7",
    "Qxg6",
    "Rxg3",
    "Ka3",
    "Ng1",
    "Rhe8",
    "Rxh7",
    "Rb8+",
    "Qc4+",
    "Kxe7",
    "Rxg2",
    "Rde8",
    "Qf6+",
    "Qc5+",
    "Qd8+",
    "Rg1+",
    "Bxc2",
    "Rbc8",
    "Ne7+",
    "Bxh5",
    "Rc2+",
    "Qxc8",
    "Nde2",
    "Qc3+",
    "Nxf2",
    "Ra7+",
    "Qxe6+",
    "Nbc6",
    "Qe7+",
    "Qd1+",
    "Rfb1",
    "Nd3+",
    "Rxf8+",
    "Rxh3",
    "Nxc8",
    "Qg6+",
    "Bc5+",
    "Nxc7",
    "Qe1+",
    "Ka6",
    "gxh3",
    "Rb2+",
    "Rhg1",
    "Nf5+",
    "Ne4+",
    "Rg8+",
    "Rf8+",
    "Rhf1",
    "Re7+",
    "Qe2+",
    "Rec8",
    "Qe8+",
    "Qd3+",
    "Rb1+",
    "Nf4+",
    "Bd4+",
    "Bg1",
    "Qxf7",
    "Rdc1",
    "Rxf1+",
    "Ne5+",
    "Qc1+",
    "Qh2",
    "Rhd8",
    "Raf8",
    "Re2+",
    "Nxc2",
    "exd3",
    "Qc6+",
    "Qxe8",
    "Bxa2",
    "Rxc1+",
    "Rxc8+",
    "Kxd2",
    "Bxf7+",
    "Ne2+",
    "Qb8+",
    "Qxg7",
    "Qxd1+",
    "Ka4",
    "Rxh2",
    "Qd6+",
    "Qc8+",
    "Rec1",
    "Nce4",
    "Qxe1",
    "Rbd1",
    "Ra2+",
    "Kxf3",
    "Rbc1",
    "Qxf2",
    "Raf1",
    "Rb7+",
    "Ka5",
    "Rf2+",
    "Bc4+",
    "Ng5+",
    "Rf7+",
    "Qxc1",
    "a2",
    "Nd5+",
    "Nxg7",
    "Qb3+",
    "Qxa8",
    "Rdc8",
    "Ra6+",
    "Ra8+",
    "Ra3+",
    "Kxd7",
    "Qa1+",
    "c7",
    "Qb1+",
    "Ba1",
    "Qxf7+",
    "Ka8",
    "Nxf8",
    "Qc2+",
    "Kxd1",
    "Nbc3",
    "Nxd8",
    "Kxh7",
    "Bxe8",
    "Qxh3",
    "Bxf7",
    "Qa8+",
    "Nxd1",
    "Kxe2",
    "Qb7+",
    "Rd3+",
    "Qc7+",
    "Qxe5+",
    "Qd7+",
    "Bxf2+",
    "Rhg8",
    "Qg8",
    "Kxg6",
    "c2",
    "Ne6+",
    "Qf7+",
    "Qh7",
    "Re3+",
    "Nbd5",
    "Rb3+",
    "Nxe8",
    "Rc3+",
    "Kxe6",
    "Qf3+",
    "Ra1+",
    "Qg3+",
    "Bh8",
    "Rd6+",
    "Qb2+",
    "Re6+",
    "Kxf4",
    "b7",
    "Qxd5+",
    "Rbd8",
    "dxe3",
    "Rg2+",
    "Nxa3",
    "Qxd2+",
    "Rh1+",
    "Qb5+",
    "Nd4+",
    "Rg7+",
    "d2",
    "Qb4+",
    "Nxc1",
    "b2",
    "Rg3+",
    "Rdf1",
    "Bxh7+",
    "Kxg5",
    "Nce7",
    "Rc6+",
    "Nxg2",
    "Qh6+",
    "Nxe2+",
    "Kxf5",
    "Bd5+",
    "Bxf2",
    "Rb6+",
    "Rg6+",
    "Bxa1",
    "Rh7+",
    "Rg4+",
    "Rf5+",
    "Rf6+",
    "Rf3+",
    "Qxa1",
    "Qh7+",
    "Nfd5",
    "Qh8+",
    "Qxg2",
    "Kxe5",
    "Kxg3",
    "Qxf2+",
    "Qh3+",
    "Nxa7",
    "Qxe3+",
    "Kxg4",
    "Rhf8",
    "Kxe4",
    "Ng4+",
    "Qxd4+",
    "Qd2+",
    "Rh2+",
    "Rh8+",
    "Rg5+",
    "Rdg1",
    "Re4+",
    "Rxf7+",
    "Rce8",
    "Kxd6",
    "Kxe3",
    "Bg8",
    "Ne3+",
    "Nxa8",
    "Kxh5",
    "Re5+",
    "Bxe1",
    "Qg8+",
    "Rf4+",
    "Rxh1",
    "Rh3+",
    "Qg1",
    "Qf8+",
    "Bxe3+",
    "e7",
    "e2",
    "Rce1",
    "Bg5+",
    "Qh1+",
    "h7",
    "f5+",
    "Nbd4",
    "Nxd3+",
    "Ra4+",
    "Rd5+",
    "Bxd4+",
    "f4+",
    "Qxg6+",
    "Nxe1",
    "Rc5+",
    "Nde5",
    "Nxa2",
    "Rdd1",
    "Bxe6+",
    "Nce5",
    "Rh6+",
    "Rhc8",
    "Nc5+",
    "Rxh8",
    "Qxf8",
    "Bxb1",
    "Nhf6",
    "Rd4+",
    "Kxh6",
    "Kxh4",
    "Kxd5",
    "Qxf6+",
    "Kxd4",
    "g4+",
    "Qxe4+",
    "Qf2+",
    "Qa7+",
    "Be6+",
    "Ned7",
    "g5+",
    "Rcc1",
    "Rdf8",
    "Rxg7+",
    "Nec6",
    "Ra5+",
    "Bxb8",
    "Qf1+",
    "Qg1+",
    "h2",
    "Nxh6",
    "Qxh7",
    "Nbxd4",
    "Nxf1",
    "Nge5",
    "Raa8",
    "Rbe8",
    "Nbxd2",
    "Rb5+",
    "Rbe1",
    "Qh8",
    "Qxf3+",
    "Nh6+",
    "Qxe7+",
    "Be5+",
    "Nfd4",
    "Kxc5",
    "Nxh7",
    "Nde4",
    "Rhc1",
    "Nf7+",
    "Qh1",
    "Rcc8",
    "Nxa1",
    "Nc4+",
    "Reb8",
    "Nxd6+",
    "Kxb2",
    "Ree8",
    "Kxh2",
    "Qxg7+",
    "Nd2+",
    "Rdg8",
    "f2",
    "Qg7+",
    "Qxe2+",
    "Nc6+",
    "Kxc4",
    "Ree1",
    "Rb4+",
    "Be3+",
    "Nfe4",
    "Rfa1",
    "Rxf2+",
    "Nfe5",
    "Ncd7",
    "f7",
    "Qh2+",
    "Nf2+",
    "f6+",
    "Kxe8",
    "Qxd7+",
    "Be4+",
    "Qa2+",
    "Rdd8",
    "Rxg6+",
    "Nh3+",
    "Kxb4",
    "Qxg3+",
    "Rc4+",
    "exf7+",
    "Rxe7+",
    "Bf5+",
    "Kxd3",
    "Qg2+",
    "Bh1",
    "Rxg2+",
    "Bxd5+",
    "Nc7+",
    "Rxg8",
    "N1c3",
    "Kxh3",
    "Nd7+",
    "Nxe6+",
    "Na8",
    "Ned5",
    "Qa6+",
    "Nxh3",
    "Qxh2",
    "Rh5+",
    "g7",
    "Kxc2",
    "Rxd7+",
    "Qxb8",
    "Qxc6+",
    "Ncd5",
    "Bf4+",
    "h4+",
    "Rh4+",
    "Nef6",
    "Ndxe5",
    "Bxh2+",
    "Qxc5+",
    "Rfa8",
    "Qxf1",
    "h5+",
    "Nc3+",
    "Bxh7",
    "Rbb8",
    "Bg4+",
    "Kxc3",
    "Kxc6",
    "fxg7",
    "Ng6+",
    "Nxh3+",
    "Rxe2+",
    "Rcb8",
    "Qxb1",
    "Bxb5+",
    "Reb1",
    "Qxg2+",
    "Qxg5+",
    "e5+",
    "Nge4",
    "Nfxd5",
    "g2",
    "Qa3+",
    "N7f6",
    "Raa1",
    "Kxe1",
    "Rxg5+",
    "hxg5+",
    "Kxb5",
    "Bh6+",
    "Ned4",
    "Bh7+",
    "hxg4+",
    "exf6+",
    "Bxf6+",
    "Qxc3+",
    "Red2",
    "Kxb3",
    "Qxh6+",
    "N8d7",
    "Qxg4+",
    "Kxb7",
    "Bd3+",
    "Nxh2",
    "Nbxd5",
    "Ndc5",
    "Nh5+",
    "Kxb6",
    "Kxa5",
    "Nc2+",
    "Rxg3+",
    "Rxg4+",
    "Kxc7",
    "Ngxe5",
    "Bd6+",
    "Nec3",
    "f3+",
    "Rcc7",
    "Ncxe5",
    "Qxf5+",
    "Rag8",
    "Nxh6+",
    "Kxg8",
    "Rdb8",
    "Rxg1",
    "e4+",
    "a8=Q",
    "Kxa4",
    "Rdd2",
    "Rxe5+",
    "R1d2",
    "Ng3+",
    "Bb3+",
    "Rxc2+",
    "Bxg7+",
    "Bh4+",
    "Nxb8",
    "Nh4+",
    "Rxe6+",
    "a1=Q",
    "Rcf8",
    "Rxb2+",
    "Ref8",
    "N2f3",
    "Rdb1",
    "gxf4+",
    "Qxf4+",
    "Ref1",
    "Nh1",
    "N1h2",
    "Qxe8+",
    "Ncb5",
    "Qxc8+",
    "Rdd7",
    "e6+",
    "Qxh5+",
    "Rff8",
    "Qxf8+",
    "Rxd2+",
    "Na1",
    "Kxa3",
    "Qxh7+",
    "Rfxd8",
    "Ncxe4",
    "Rxf6+",
    "c4+",
    "Bg6+",
    "Ndxe4",
    "c5+",
    "Ree7",
    "h6+",
    "Kxa6",
    "Rxh7+",
    "Rea1",
    "Bc6+",
    "Bxc5+",
    "Neg4",
    "Bxh2",
    "Nxe5+",
    "Kxg1",
    "Bc3+",
    "Bf6+",
    "Rag1",
    "Ncd2",
    "Nxe4+",
    "Qxc4+",
    "Rxe3+",
    "hxg6+",
    "Rxf5+",
    "Nfxd4",
    "Bh5+",
    "Nh8",
    "Rxb8+",
    "Raxd1",
    "Qxc1+",
    "Rde2",
    "Neg5",
    "Qxd6+",
    "Ree2",
    "Bxh8",
    "Nbxd7",
    "Nxf4+",
    "Qxe1+",
    "Rxc3+",
    "Bh2+",
    "gxf5+",
    "Rcc2",
    "Ndb4",
    "Rxh3+",
    "Nxf7+",
    "Rxf4+",
    "Qxh4+",
    "Rge1",
    "Nhf5",
    "Bh3+",
    "d6+",
    "Rhh1",
    "Nhf3",
    "Rcd2",
    "cxb2",
    "d4+",
    "Rxf3+",
    "Rxe4+",
    "Qxb7+",
    "Raxc8",
    "g6+",
    "Bb6+",
    "Bxe4+",
    "Rcd7",
    "R1e2",
    "Qxh2+",
    "Qxb5+",
    "Ba4+",
    "Ncb4",
    "h8=Q",
    "Rxh5+",
    "fxe5+",
    "Bxh1",
    "Rbb1",
    "N1d2",
    "Rdc7",
    "Rxb7+",
    "gxf7+",
    "Nxf5+",
    "Nxb1",
    "Nac5",
    "Rfxd1",
    "Qxf1+",
    "Qxh3+",
    "Raxd8",
    "Bf3+",
    "hxg3+",
    "Bxb4+",
    "Rcb1",
    "Rff1",
    "Red7",
    "Ndc4",
    "Rxh4+",
    "N6d7",
    "Nexd4",
    "Qxb2+",
    "Rxg8+",
    "b8=Q",
    "Ned2",
    "Bxe5+",
    "O-O-O+",
    "Rxa8+",
    "cxb7",
    "exf2+",
    "Nef3",
    "Qxc2+",
    "Nfg4",
    "Rdc2",
    "Qxc7+",
    "Rhb8",
    "Nb5+",
    "Rxd5+",
    "Bxg6+",
    "Ba3+",
    "Bxf3+",
    "R8e7",
    "dxe7",
    "Rdh1",
    "Bg3+",
    "Nxd5+",
    "Qxb4+",
    "Nb6+",
    "Nxg6+",
    "h3+",
    "Kxh8",
    "c8=Q",
    "Rbb7",
    "c1=Q",
    "N7b6",
    "Bxf5+",
    "Nxh1",
    "d5+",
    "Nde7",
    "fxg6+",
    "R1c2",
    "e3+",
    "fxg2",
    "Nce3",
    "Rxh2+",
    "Ncd4",
    "hxg7",
    "fxg5+",
    "Raxc1",
    "Red3",
    "Rxc7+",
    "Rxg1+",
    "Rff7",
    "Rxd3+",
    "d8=Q",
    "b4+",
    "Rxc6+",
    "Ne8+",
    "Rbf8",
    "Rxh6+",
    "Rxd6+",
    "hxg2",
    "Rff2",
    "fxg4+",
    "Bxc4+",
    "Rea8",
    "g3+",
    "gxh5+",
    "Rxd4+",
    "h1=Q",
    "Rxb1+",
    "Rde7",
    "Bxg2+",
    "Ncxd5",
    "Bf7+",
    "Kxc1",
    "Rfd2",
    "b1=Q",
    "Bxd3+",
    "Nxc6+",
    "Nac4",
    "R8d7",
    "Rca8",
    "Qxh1",
    "exf4+",
    "Rce7",
    "Bxg5+",
    "Nhf4",
    "Nb3+",
    "Bxf4+",
    "Qxh8",
    "Rec7",
    "Nxg7+",
    "Rhb1",
    "Kxa7",
    "Rgd1",
    "Nac3",
    "Rxa1+",
    "Nxf2+",
    "Ne1+",
    "gxf6+",
    "Ned3",
    "R3e2",
    "N5f6",
    "Nef4",
    "dxc7",
    "Kxc8",
    "Nxe3+",
    "Nexd5",
    "Bxd6+",
    "Nxb3+",
    "Ngxe4",
    "gxf3+",
    "Nxd4+",
    "Nxc7+",
    "fxg3+",
    "Nb4+",
    "Rxa2+",
    "Kxa2",
    "Rbb2",
    "Nxg5+",
    "Rad7",
    "Qxa2+",
    "Rdd3",
    "Rgf1",
    "Rdf2",
    "Ree3",
    "fxe4+",
    "Nbc5",
    "Nef5",
    "N1e2",
    "gxh7+",
    "exf7",
    "f8=Q",
    "Nfg5",
    "axb7",
    "Rcf1",
    "Nec5",
    "fxe6+",
    "Rge8",
    "Raa7",
    "exd5+",
    "Rbf1",
    "Rcg8",
    "Rxa7+",
    "Rah1",
    "Rfe2",
    "Rdh8",
    "Ba6+",
    "e1=Q",
    "Nfxe4",
    "Nxh8",
    "Rec2",
    "b5+",
    "Bf2+",
    "Bxb2+",
    "Nec4",
    "Ncd6",
    "f1=Q",
    "N5c3",
    "Nfe3",
    "Nxg3+",
    "Rca1",
    "g8=Q",
    "Nfd3",
    "Rxb6+",
    "Qxb6+",
    "Bxg3+",
    "Qxd3+",
    "Rba1",
    "Rgf8",
    "exf5+",
    "Nbc4",
    "Nxc3+",
    "R8c7",
    "Ned6",
    "b3+",
    "Nf1+",
    "N4d5",
    "Rff3",
    "Rxb3+",
    "Rfe7",
    "R3d2",
    "Ndf5",
    "e8=Q",
    "Bxe7+",
    "R8f7",
    "Bd7+",
    "Bxg8",
    "Nxg4+",
    "exf3+",
    "Rdd6",
    "R1f2",
    "Nxc2+",
    "Na4+",
    "Ba5+",
    "Nd8+",
    "Qxg8",
    "axb2",
    "Bxg1",
    "cxd7",
    "Qxa8+",
    "Rfg8",
    "Nfe6",
    "exd7",
    "f7+",
    "Rac7",
    "Qxb3+",
    "Rbc7",
    "Rde3",
    "Nxg8",
    "Bxh6+",
    "Red6",
    "N4f3",
    "Rxc5+",
    "Ref2",
    "Rgg8",
    "R1d3",
    "exd6+",
    "b6+",
    "Be2+",
    "Rce2",
    "axb4+",
    "Ngf5",
    "fxe7",
    "N8e7",
    "Nce6",
    "d3+",
    "Bc2+",
    "Rhh8",
    "b1=Q+",
    "g1=Q",
    "Rfd7",
    "Qxa1+",
    "Bxe2+",
    "Rxh8+",
    "Bd2+",
    "c3+",
    "Ndb6",
    "d1=Q",
    "Qxg1+",
    "R1a2",
    "Rah8",
    "Rda1",
    "Bg7+",
    "Ng7+",
    "Nhf8",
    "R6e7",
    "Nfxe5",
    "gxh4+",
    "Rbd2",
    "Rxc4+",
    "N8h7",
    "Ndf1",
    "Ndf8",
    "Rda8",
    "Nfe7",
    "Raa2",
    "dxe5+",
    "Be7+",
    "Qxa7+",
    "Rfg1",
    "Nde3",
    "Ref7",
    "Ndxb5",
    "Nf8+",
    "Qxa6+",
    "Rab6",
    "R4d2",
    "R6d7",
    "Ree6",
    "Rha1",
    "Rfc7",
    "Rgd8",
    "Nxh7+",
    "Ndf4",
    "Ng2+",
    "Ncxd4",
    "Bxb7+",
    "Rexd8",
    "Nh7+",
    "Nac7",
    "Reh1",
    "Rxb4+",
    "Nfe2",
    "dxc2",
    "Rge3",
    "Nac6",
    "Neg6",
    "Rgg1",
    "gxf2+",
    "Nxd7+",
    "dxe2",
    "e7+",
    "Nxc5+",
    "Qxg1",
    "Red5",
    "Ncb6",
    "Qxa4+",
    "Kxh1",
    "Nd1+",
    "Qxg8+",
    "R5e3",
    "Reg8",
    "Rae2",
    "Bb7+",
    "Nb2+",
    "R8d6",
    "Ref3",
    "a5+",
    "dxc5+",
    "Nce8",
    "Ndc6",
    "Rab7",
    "bxa2",
    "Qxb8+",
    "Ndb8",
    "Na3+",
    "dxe4+",
    "a4+",
    "N5b6",
    "Nde6",
    "Bc1+",
    "Rgc8",
    "Rcc3",
    "Rbd7",
    "gxh6+",
    "Rdc3",
    "N7c6",
    "bxc4+",
    "Rdf7",
    "Ncd3",
    "R3f2",
    "Nbd3",
    "R1e3",
    "e2+",
    "Nhf1",
    "R6d2",
    "Rcd3",
    "d8=Q+",
    "Rhg2",
    "Rdd5",
    "R4c7",
    "Reg1",
    "d7+",
    "Rbc2",
    "hxg7+",
    "Ngf8",
    "a8=Q+",
    "Nxc4+",
    "Na5+",
    "Nab4",
    "Rbd3",
    "Rfc2",
    "Rcc6",
    "Rxh1+",
    "Nge6",
    "N3d2",
    "Nxe8+",
    "c6+",
    "Nxc8+",
    "R4f2",
    "Rac2",
    "Rbc6",
    "Rce3",
    "Rdf3",
    "axb5+",
    "cxd5+",
    "h7+",
    "R4a3",
    "R5d3",
    "Nfg6",
    "N2b3",
    "dxc6+",
    "Rhe1+",
    "f2+",
    "Rfe6",
    "N3h2",
    "Ndc3",
    "Rcf2",
    "a3+",
    "Bg2+",
    "Nab5",
    "Rba8",
    "Rhf3",
    "Rge5",
    "cxd2",
    "Bd8+",
    "Be8+",
    "Qxb1+",
    "d2+",
    "Kxa8",
    "Ndb3",
    "bxc3+",
    "b8=Q+",
    "R8e6",
    "Bf8+",
    "Rcd6",
    "Be1+",
    "R2d3",
    "R8b7",
    "Rfe3",
    "Kxb1",
    "Ndxc5",
    "Nxd8+",
    "Nfd6",
    "N3h4",
    "Ndb1",
    "R5c7",
    "Bb2+",
    "Rfe1+",
    "f8=Q+",
    "Nb7+",
    "exd7+",
    "Rac3",
    "Rbe7",
    "Rab2",
    "fxe3+",
    "Kxb8",
    "Rgg7",
    "e1=Q+",
    "Qxa5+",
    "Nxh5+",
    "Rgc1",
    "Rgf3",
    "Bc7+",
    "Ndxc4",
    "Nxg1",
    "R4d3",
    "Nbc7",
    "Nbc8",
    "Rxa3+",
    "Rab3",
    "Rha8",
    "d1=Q+",
    "gxh7",
    "Nxb6+",
    "hxg2+",
    "Rcb7",
    "Nfe8",
    "Rad1+",
    "Rdb7",
    "Nfxd7",
    "Reb7",
    "Raxb1",
    "bxc5+",
    "Ngf4",
    "R5e6",
    "a6+",
    "Naxc4",
    "Ncxe7",
    "Nxf8+",
    "N6h5",
    "Nba4",
    "R1b2",
    "Nxd2+",
    "Nc8+",
    "Ncxb5",
    "Rac6",
    "Rgh1",
    "Rxa4+",
    "exd4+",
    "Qxh1+",
    "R6f7",
    "N3d4",
    "Qxa3+",
    "Rch8",
    "bxc7",
    "Raa6",
    "Raf7",
    "bxa7",
    "R1d5",
    "R3c2",
    "R5d7",
    "bxc2",
    "Rba7",
    "Rbb6",
    "Rhh2",
    "e8=Q+",
    "Nba6",
    "R1d4",
    "dxe6+",
    "Rcf7",
    "Rbg1",
    "Rfd3",
    "f1=Q+",
    "Nh2+",
    "Rexe5",
    "Nxe1+",
    "R7e6",
    "Rfxe8",
    "Ndc2",
    "Bg1+",
    "R5e7",
    "Rhd3",
    "axb3+",
    "c8=Q+",
    "Ngf1",
    "Rcc4",
    "Rxb5+",
    "Qxh8+",
    "R4e3",
    "Rgf6",
    "Nab6",
    "Rdd4",
    "gxf7",
    "Ngxe7",
    "R8a7",
    "Rad2",
    "Reg2",
    "Ngxe2",
    "Rfd6",
    "Naxc5",
    "Rfh1",
    "Raa3",
    "N8c6",
    "Nfh5",
    "cxb5+",
    "Rhf5",
    "R1c3",
    "Rgb8",
    "Nfxd2",
    "R5c3",
    "N4c6",
    "Nxa2+",
    "Rce6",
    "Rec3",
    "Rfg2",
    "Rhh7",
    "dxc3+",
    "Rcc5",
    "Rhxf1",
    "Nxh4+",
    "Rbf7",
    "Nce1",
    "Rcb6",
    "Rba2",
    "exd2",
    "exf2",
    "Rdc6",
    "Rfb7",
    "Ng1+",
    "R8c6",
    "Rff4",
    "cxb4+",
    "Bxg4+",
    "N2c3",
    "R5e2",
    "Rbe2",
    "Nhg4",
    "R1a3",
    "Rec4",
    "Rbc3",
    "Bc8+",
    "Rae7",
    "Bf1+",
    "Nc1+",
    "Rae6",
    "Ref6",
    "Rgf7",
    "Ng8+",
    "R5d4",
    "Raxa6",
    "Rde6",
    "N3a4",
    "R8d3",
    "Na6+",
    "Rfe4",
    "R4a2",
    "Rhd2",
    "Ba7+",
    "g1=Q+",
    "N6d5",
    "Raf2",
    "Rcb2",
    "g8=Q+",
    "Bxh4+",
    "Rcg1",
    "Rge7",
    "cxd4+",
    "R8d4",
    "Rcd5",
    "Nxg2+",
    "gxh3+",
    "R6c7",
    "Reh8",
    "Rhg3",
    "Rbxc8",
    "Rde4",
    "Nxb4+",
    "Rcxc3",
    "Rdb2",
    "Rac5",
    "a1=Q+",
    "Rbd6",
    "c1=Q+",
    "Nexg4",
    "Nxf1+",
    "Rdf6",
    "dxc4+",
    "Nac2",
    "cxb3+",
    "Nxb7+",
    "Rbg8",
    "fxg7+",
    "R1f3",
    "fxe2",
    "N2g3",
    "R7d6",
    "R8g7",
    "Rfxc8",
    "axb6+",
    "Nef6+",
    "dxe3+",
    "R5c2",
    "R6d3",
    "Rcd4",
    "N7d5",
    "Nhg5",
    "R4c5",
    "R5d2",
    "Rgg2",
    "Bd1+",
    "R5f7",
    "R8c3",
    "Rexd1",
    "Rhg6",
    "Na2+",
    "R4e2",
    "Rba3",
    "Bg8+",
    "R6d4",
    "R4f7",
    "Rge6",
    "Rhe2",
    "gxh2+",
    "Nxb2+",
    "Nec7",
    "Neg8",
    "Rca7",
    "Red4",
    "R4d7",
    "Rgh8",
    "Nfe1",
    "Nexc6",
    "g7+",
    "N5e4",
    "Nge3",
    "Nxh2+",
    "R8f6",
    "Rec6",
    "Nxb5+",
    "g2+",
    "R4c6",
    "Rdc4",
    "Rdxd2",
    "b7+",
    "dxe8=Q+",
    "Rcxd5",
    "Rcxd6",
    "Rbb3",
    "Rhg4",
    "Rxa6+",
    "Bxa7+",
    "R1h2",
    "Ba2+",
    "R1h3",
    "Rgf5",
    "Rfg7",
    "N7g6",
    "Rfe5",
    "R7d5",
    "Rda7",
    "Bxh5+",
    "R4e6",
    "Rbb5",
    "Rexc8",
    "Neg3",
    "Ncd1",
    "Rbe6",
    "Rdxd3",
    "R1a6",
    "R5f6",
    "Rad3",
    "Rad6",
    "Reg3",
    "fxg2+",
    "Nba3",
    "Nca4",
    "Ncb8",
    "Naxb5",
    "R1f4",
    "Rgf2",
    "Ree5",
    "Ndxe6",
    "Rad8+",
    "Rgg3",
    "Nexc4",
    "N4b3",
    "Rgc4",
    "R1g2",
    "Ndf7",
    "Nexc3",
    "Nhf7",
    "R3c5",
    "Rdxd5",
    "Rfxc1",
    "Rgd4",
    "Rfxf2",
    "Rac4",
    "Rdxd4",
    "Rff6",
    "Rfxe1",
    "h2+",
    "Bxb3+",
    "Nexd6",
    "R6d5",
    "Rhf7",
    "h1=Q+",
    "Ndxb4",
    "R2d4",
    "Rfg3",
    "Rhg8+",
    "Kd3+",
    "Nge8",
    "R3d7",
    "Rdxc1",
    "Rea7",
    "Rbe3",
    "Rbxd5",
    "Bxa4+",
    "Bxh3+",
    "N5c6",
    "N5xe4",
    "R2c6",
    "h8=Q+",
    "Kxa1",
    "R3c6",
    "R5b6",
    "Raa4",
    "Rfb2",
    "Rgh2",
    "Bb8+",
    "Rfxf7",
    "Bxa3+",
    "Nbc2",
    "bxa3+",
    "R1e4",
    "Rfd5",
    "N7a6",
    "R3a2",
    "Rca2",
    "Bxc7+",
    "Rcxd2",
    "Nfxg4",
    "R7c6",
    "Rfh2",
    "Bxa6+",
    "O-O+",
    "Rcxd8",
    "Bxc2+",
    "N8a7",
    "Rhe8+",
    "cxb2+",
    "Nab3",
    "Rbf2",
    "Rcb3",
    "Ncb1",
    "Ndxe2",
    "Rch1",
    "Rdg2",
    "Rxa5+",
    "Rfe8+",
    "cxd6+",
    "N6c5",
    "R2f3",
    "Rbg7+",
    "Nb8+",
    "Rff5",
    "Nab8",
    "R5e4",
    "Na7+",
    "cxb6+",
    "N2e4",
    "Nxa5+",
    "R2e6",
    "R8e5",
    "Rfxf5",
    "Ke3+",
    "Nbd6",
    "Rda3",
    "cxd2+",
    "Nfxg5",
    "exd3+",
    "Rexe2",
    "Bxa5+",
    "N5a3",
    "Nfg8",
    "R4c3",
    "R5h3",
    "Raxa2",
    "axb2+",
    "Ree4",
    "N1f3",
    "Raf3",
    "R4b7",
    "Rexd2",
    "Rgb1",
    "c7+",
    "Neg1",
    "Neg5+",
    "R5d6",
    "Rbb4",
    "Rbxd8",
    "Nxa7+",
    "R8c4",
    "R8g6",
    "Rae8+",
    "Rfxe4",
    "N2c4",
    "R1c4",
    "R3d6",
    "R4e7",
    "Rcb4",
    "Rge2",
    "Rhh3",
    "N2d3",
    "R8d5",
    "Rgg4",
    "Rgh7",
    "Nexf7",
    "b2+",
    "N5d4",
    "Ngh5",
    "R2c4",
    "R4c2",
    "Rab5",
    "Rdxd6",
    "Rexe3",
    "N5g6",
    "Rdxe6",
    "Rfh4",
    "N1a2",
    "Raxf8",
    "Rexe6",
    "Rexe7",
    "Rhf4",
    "R2a4",
    "R7d4",
    "R8b5",
    "R8c5",
    "Rdxd7",
    "Rgh4",
    "Nxa6+",
    "Nxd1+",
    "R6b2",
    "Rca3",
    "Rda2",
    "Rda5",
    "Ngxe6",
    "bxc2+",
    "Nexg5",
    "R1c6",
    "Rfg4",
    "Ndb2",
    "Ngxf7",
    "Rfh3",
    "R5f4",
    "R6b7",
    "Rad5",
    "Rbxc3",
    "Reg4",
    "Nfg4+",
    "R7f6",
    "Rcxd4",
    "N6xd5",
    "R3b5",
    "R7e4",
    "Raxa7",
    "Rexd3",
    "Ncd8",
    "Ncxe6",
    "Ndxc6",
    "Rbxb2",
    "Rcxd1",
    "R2d5",
    "R7c5",
    "Rbxb7",
    "Rexe4",
    "Bxf1+",
    "Rcxc4",
    "Rgg6",
    "Rbxb5",
    "Reb2",
    "bxa2+",
    "N4xd5",
    "Ncxd6",
    "Rbc4",
    "Rbc5",
    "Rbd5",
    "Rcxc7",
    "Rdh3",
    "N5f3",
    "N8e6",
    "R3e7",
    "R5g6",
    "Rbh1",
    "Rdf4",
    "Rfg6",
    "Rhd8+",
    "R7e2",
    "Rae1+",
    "Rfd4",
    "Rhc2",
    "N7e5",
    "Ndc7",
    "Ned1",
    "R8a6",
    "Rae3",
    "Nfg1",
    "Nhg7",
    "R1b3",
    "R5f3",
    "Rcxc2",
    "Rec5",
    "Nhxf4",
    "Nb1+",
    "R4b3",
    "Rfh8",
    "Rhd4",
    "Bxf8+",
    "Ref4",
    "Rfxf6",
    "Rgd6",
    "c2+",
    "Nef7",
    "R5c4",
    "Rce5",
    "Ndxf3",
    "Rdb6",
    "Rexd4",
    "Bxb6+",
    "R6a3",
    "Ref5",
    "Rfg5",
    "Rgd2",
    "R3d5",
    "Rba4",
    "Rbh8",
    "Rgf4",
    "Rhf2",
    "cxb7+",
    "Nac1",
    "Rba5",
    "gxf2",
    "Nfd8",
    "R3e5",
    "R4d5",
    "Rea3",
    "Rgxg7",
    "Rhf6",
    "N7e6",
    "Nfxe3",
    "R3f4",
    "R3xd4",
    "R5a3",
    "Rcxc5",
    "gxf8=Q+",
    "Nhg2",
    "R7d3",
    "Reg7",
    "gxf1=Q+",
    "Nba5",
    "Ncb3",
    "Nfd1",
    "Nfxe6",
    "R5b7",
    "R8c2",
    "R8e4",
    "Rbd4",
    "Rgh3",
    "dxe1=Q+",
    "Nec2",
    "R1a5",
    "Rac1+",
    "Rdc5",
    "Nxa4+",
    "Rhxh7",
    "cxd8=Q+",
    "Nec1",
    "Nef2",
    "Nfh2",
    "Nhg6",
    "Rbxb3",
    "Rdg4",
    "Rgc7",
    "bxc6+",
    "N6a5",
    "R1g4",
    "Rbxa7",
    "dxc8=Q",
    "R2c7",
    "R8e2",
    "R8xe5",
    "N8g6",
    "R2e4",
    "R6e2",
    "R1xd4",
    "R3h2",
    "Rcxd7",
    "Rhh4",
    "Ncxe3",
    "R4d6",
    "Rga1",
    "N7c5",
    "N8c7",
    "Nab7",
    "Ngf2",
    "R5c6",
    "Rde5",
    "dxe7+",
    "N7xf6",
    "Ndxb6",
    "R1c5",
    "Raxb3",
    "Ndxe3",
    "Ngf7",
    "R8a4",
    "Rfxf4",
    "Rhd6",
    "Rhh6",
    "R7d6+",
    "Rdb4",
    "N6h7",
    "N8xd7",
    "R3c7",
    "R3g2",
    "R7c3",
    "R8xd7",
    "Rag7",
    "Rcf3",
    "Rhg7+",
    "Nhg3",
    "R6e5",
    "Rfa4",
    "Kc6+",
    "R3a7",
    "N8d6",
    "Nbxc4",
    "Nfxd5+",
    "exf8=Q+",
    "Bxa2+",
    "Neg4+",
    "Nfxe8",
    "Rdxc2",
    "exf1=Q+",
    "Nde8",
    "R2c3",
    "R4f3",
    "R6b4",
    "Rce4",
    "N8g7",
    "Ncb2",
    "Ngh6",
    "R1b6",
    "R6g3",
    "Raxb8",
    "Rba6",
    "Rdxf1",
    "Reh7",
    "Rfxe7",
    "Kf6+",
    "N3g4",
    "Ndc8",
    "Ndxf6",
    "R1e5",
    "R4b2",
    "Rdg3",
    "Rfh5",
    "Nbxc3",
    "Ncxd8",
    "Ngxf3",
    "Kf3+",
    "Nexd2",
    "Nexf4",
    "Ngxf5",
    "Nxa3+",
    "Rdb3",
    "Rexc2",
    "Rfd8+",
    "Nfxg6",
    "Ngh4",
    "Ngxf6",
    "R2d6",
    "R4f6",
    "R8b4",
    "R8h7",
    "Raa5",
    "Rdh6",
    "Rgh6",
    "dxc2+",
    "fxe7+",
    "N4xe5",
    "R3b6",
    "Rgd3",
    "a2+",
    "Ke6+",
    "Nbxa4",
    "Ndxc3",
    "Nexd7",
    "R5a7",
    "Rbxb4",
    "R5b2",
    "R7e6+",
    "Rbf4",
    "Rgg5",
    "Rhg7",
    "Rhxg8",
    "cxd3+",
    "Nbxc5",
    "Nfh6",
    "R3b2",
    "Rfxf3",
    "Ncd3+",
    "R3b7",
    "R4b5",
    "R6e4",
    "Raxb2",
    "Rca4",
    "Rdf5",
    "Nfh3",
    "R5a2",
    "R1d7",
    "R3a4",
    "R8d2",
    "Rdb5",
    "Rfh7",
    "Nfxe7",
    "R4g5",
    "R7h3",
    "Raxa3",
    "Rhe3",
    "Ngxf4",
    "R2d3+",
    "R5g3",
    "R8f5",
    "Raxc5",
    "Rbe4",
    "Rdxe4",
    "Reb3",
    "R8xd4",
    "Raxe8",
    "Rbxb6",
    "Rexd5",
    "Bxd8+",
    "N4e5",
    "N6d4",
    "Qg7#",
    "R1xe6",
    "R7a6",
    "R7e5",
    "Rad4",
    "Rae4",
    "Rdxc4",
    "Ke4+",
    "N3xd4",
    "R4g7",
    "R5f2",
    "R8h6",
    "Rae5",
    "Raxd3",
    "Rbg3",
    "Reh4",
    "axb7+",
    "exd2+",
    "h8=N+",
    "R3d4",
    "Rbxa5",
    "Rcxa5",
    "Rdg7",
    "N6e5",
    "Nhf2",
    "Nxg8+",
    "Raxa4",
    "Rdg1+",
    "Rfa7",
    "Rfxd4",
    "Rhxd5",
    "bxc8=Q+",
    "N5a4",
    "R1d6",
    "R2a3",
    "R8a3",
    "Rca6",
    "Bb1+",
    "Kd5+",
    "Rbg2+",
    "Rcxe6",
    "Rdxc3",
    "Rexd7",
    "Ndf2",
    "Rexe6+",
    "N2d4",
    "N4g3",
    "Nac8",
    "Nfg3",
    "Ngxe3",
    "R1b4",
    "Rhg1+",
    "Nce2+",
    "Qg2#",
    "Rdxa4",
    "Rdxe2",
    "Rfc3",
    "Rhc6",
    "N1xe2",
    "Nxc1+",
    "R1b7",
    "R2e3+",
    "R3a6",
    "R3h7",
    "bxa4+",
    "R4g6",
    "R7h6",
    "Raxf1",
    "Rda6",
    "Rhxe8",
    "Bxg1+",
    "N6b5",
    "N6g5",
    "Nec8",
    "Nexc5",
    "Ngh7",
    "R6a4",
    "Rac8+",
    "Rdg6",
    "Rexf4+",
    "R5b3",
    "R7d2",
    "Rbxc1",
    "Rcg7",
    "Rga8",
    "Rgc2",
    "a7+",
    "Nef4+",
    "R2f5",
    "R4e5",
    "R6g7",
    "Rag2+",
    "Raxb6",
    "Raxb7",
    "Rbe5",
    "Rbf3",
    "Rbh4",
    "Rexc5",
    "bxa5+",
    "exd8=Q+",
    "N3f4",
    "R8b3",
    "R8b6",
    "Raf6+",
    "Rea2",
    "Rexd6",
    "Rhe7",
    "Rhh5",
    "dxe2+",
    "N5f4",
    "Nca2",
    "Ndxf4",
    "Nexf6",
    "Nfe6+",
    "Nhf5+",
    "Nhxf3",
    "R4h2",
    "R7xe6",
    "Rdxc8",
    "Rfxe6",
    "fxe1=Q+",
    "Ndf6+",
    "Nfh7",
    "Ngxf2",
    "R6h7",
    "Rbxd1",
    "Rcxa6",
    "Rcxf4",
    "Rfc8+",
    "Rge4",
    "Rge4+",
    "Rgxd6",
    "Rgxg6",
    "Rhg2+",
    "gxh2",
    "Kg3+",
    "Ncxd1",
    "Neg7",
    "R7b3",
    "R7e3",
    "Rca5",
    "Rexb1",
    "Rgc6",
    "dxc7+",
    "Kc5+",
    "Ke5+",
    "N5e3",
    "Nbd3+",
    "R2c4+",
    "Rcf3+",
    "Rcg2",
    "Rea5",
    "Rhg5",
    "Kc4+",
    "N1d3",
    "N2e3",
    "Nbxa6",
    "Ndc1",
    "Ngf6+",
    "Nh1+",
    "R1b5",
    "R6a7",
    "R7f2",
    "R8e2+",
    "R8h2+",
    "Rcg3",
    "Rexc1",
    "Rhc4",
    "Ngh3",
    "R1g3",
    "R2e3",
    "R5h7",
    "Raxe3",
    "Rbd1+",
    "Rda4",
    "axb1=Q",
    "Bxc8+",
    "Nde2+",
    "R6c2",
    "R7b6",
    "Rdxe7",
    "Reb5",
    "Ke7+",
    "N4a5",
    "N4c5",
    "Ncd4+",
    "Ncxe2",
    "Nexf3+",
    "Nfxh4",
    "Nhf4+",
    "R2c5",
    "R8a2",
    "R8g5",
    "Rbxe7",
    "Bxd1+",
    "Kf7+",
    "N5g4",
    "N8a6",
    "Naxc6",
    "Ngh2",
    "R1xd3",
    "R4g3",
    "R6b5",
    "R7b2",
    "Rbxf7",
    "Rhg3+",
    "Kb4+",
    "Kxh5+",
    "N1g3",
    "Ncxd3",
    "Ngh6+",
    "R2xb3",
    "R4a5",
    "Rcxc8",
    "Rdh7",
    "dxc8=Q+",
    "Naxc7",
    "Nexf2",
    "R3f7",
    "R5a4",
    "R6f5",
    "R8a5",
    "Rab4",
    "Raxe1",
    "Rbxd4",
    "Ref2+",
    "Rfc5",
    "N3d5",
    "Nca5",
    "Nge1",
    "R1xd5",
    "R2a7",
    "R6a5",
    "Raf5",
    "Rbxa3",
    "Rcxc6",
    "Rexf4",
    "Rhe6",
    "Nce5+",
    "Nde3+",
    "Nef3+",
    "R6xe5",
    "Raxb4",
    "Rbxc4",
    "Rcb5",
    "Rgxf4",
    "Rhxc8",
    "N5d6",
    "Nab1",
    "R7b5",
    "R8h4",
    "Raxb5",
    "Raxe6",
    "Raxg7",
    "Rcxe5",
    "Rdxc6",
    "Rhe4",
    "Rhxf3",
    "fxe2+",
    "N6f5",
    "Ndxf4+",
    "R4b6",
    "Rcg2+",
    "Rdxf4",
    "Rfxg5",
    "Rhg6+",
    "axb8=Q",
    "Kb6+",
    "N3e4",
    "N7xb6",
    "Ndxf5",
    "Nexg3",
    "Nfxe7+",
    "Nhxf6",
    "R1c7+",
    "Rexc3",
    "Rfa3",
    "Rgxc3",
    "Rgxf1",
    "cxb1=Q",
    "Naxc1",
    "Nbxc1",
    "R1e7",
    "R2b3",
    "R4xf5",
    "R8xc3",
    "Rag8+",
    "Rbf6+",
    "Rce1+",
    "Rexc6",
    "Rfxc4",
    "Rge5+",
    "Rhb2",
    "N4c3",
    "Naxb4",
    "R1c6+",
    "R3e6",
    "R7c4",
    "Rbxa2",
    "Rfb3",
    "Rgc3",
    "Rhxg5",
    "N3e2",
    "Nef8",
    "Nfe2+",
    "Nfe7+",
    "R2d7",
    "R3xg6",
    "R8xd5",
    "Raf4",
    "Reb6",
    "Reg6",
    "Rfxg7",
    "Rgh5",
    "Rgxh5",
    "Rhb7",
    "Rhxe1",
    "Rhxh4",
    "hxg8=Q+",
    "N8b6",
    "Ncxa4",
    "R1xe5",
    "R1xg4",
    "R2e5",
    "R6f2",
    "R6f3",
    "Raf7+",
    "Rdxg6",
    "dxe1=R+",
    "N8f7",
    "Nca6",
    "Neg3+",
    "Nexc7",
    "Nfg7",
    "R6a2",
    "R8d7+",
    "R8xd2",
    "R8xf7",
    "Red1+",
    "Rfh6",
    "Rgb5",
    "fxe8=Q+",
    "Kd6+",
    "Kf5+",
    "N1f2",
    "N4b5",
    "N5f4+",
    "Nhxf5",
    "Qb7#",
    "R1a7",
    "R1xf5",
    "R3xb5",
    "R6e3",
    "R8xc4",
    "Rae6+",
    "Raxe4",
    "Rbxd6",
    "Rdxb4",
    "Rgb4",
    "Rhd7",
    "Rhxe2",
    "bxc8=Q",
    "Nh8+",
    "R3a5",
    "R4h6+",
    "R4xc6",
    "R6g5",
    "R6h3",
    "Rdf2+",
    "Rdxb5",
    "Rdxd8",
    "Rfxe3",
    "Rhxg4",
    "fxg8=Q+",
    "N2xb3",
    "N5xc4",
    "Nbd8",
    "Nfh4",
    "Ngxh7",
    "Qh1#",
    "R1xe3",
    "R7xf3",
    "Rcf5",
    "Rdxc7",
    "Reb4",
    "Rexa4",
    "Rexb3",
    "N5c4",
    "R1xc5",
    "R2d6+",
    "R7a6+",
    "Raxe2+",
    "Rbxc5",
    "Rbxe2",
    "Rgd7",
    "Rhg4+",
    "bxa8=Q",
    "N3f2",
    "N7a5",
    "N7h6",
    "Nexc2",
    "R2xb4",
    "R8b2+",
    "Rcg7+",
    "Rdxb3",
    "Reg5",
    "Rexe1",
    "Rfxc5",
    "Rga3",
    "Rh8#",
    "Rhxe4",
    "cxd8=Q",
    "R4h3",
    "R8xd6",
    "Rbxf1",
    "Rcb8+",
    "Rfxd5",
    "Rgb7",
    "N3c4",
    "N5xd4",
    "N8f6",
    "Nbxa5",
    "Nce6+",
    "Ncxd7",
    "Ndxf7",
    "Nef1",
    "Nhxg5",
    "Nxg1+",
    "R1h7+",
    "R1xb2",
    "R3xd6",
    "R4xa6",
    "Rch2",
    "Rcxe3",
    "Rdh5",
    "Rdxf5",
    "Rfxc2",
    "Rgc5",
    "Rhf8+",
    "Kg5+",
    "Ncd2+",
    "Ngxh6+",
    "Qh7#",
    "Qh8#",
    "R1c7",
    "R3xg7",
    "R8e3",
    "Rag7+",
    "Raxe5",
    "Rbxg7",
    "Rfb4",
    "Rhxh2",
    "bxa1=Q",
    "N5h4",
    "N6e7",
    "Nfxh7",
    "R1xf6",
    "R3c4",
    "R4xd2",
    "R7xe4",
    "R8e3+",
    "Raxd2",
    "Rfxg2",
    "Rhf1+",
    "N2a3",
    "N4a6",
    "N6c7",
    "R1c3+",
    "R4f5",
    "R8e7+",
    "R8h3+",
    "Raxd7",
    "Rcxb6",
    "Rdxc5",
    "Rfa5",
    "Rfxd6",
    "Rgd5",
    "Rgf2+",
    "Rgf7+",
    "Rgxg5",
    "N8b7",
    "Nbc1",
    "Ndxb3",
    "R3h5",
    "R3xc6",
    "R7d5+",
    "R8d3+",
    "R8h5",
    "Raf1+",
    "Rag6",
    "Rdxf7",
    "Rdxg7",
    "Rexc7",
    "Rexf7",
    "Rhd5",
    "N2b4",
    "N3c5",
    "N7xe6",
    "R1xd2",
    "R1xe2",
    "R2b6",
    "R2c3+",
    "R2xd3",
    "R3f5",
    "R7xc3",
    "Rbxf6+",
    "Rcxe8",
    "Rdh2",
    "Rhxh5",
    "a1=R",
    "N1b3",
    "Na1+",
    "Nca8",
    "Ncxb3",
    "Ndf7+",
    "Ndxb8",
    "Qb2#",
    "Qf7#",
    "R1e6+",
    "R1e7+",
    "R7a4",
    "R7e3+",
    "R7g6",
    "R8xb5",
    "Raf6",
    "Rbxa4",
    "Rcg5",
    "Rch3",
    "Rexe2+",
    "Rfb6",
    "Rfc1+",
    "Rfxb5",
    "Rgxc2",
    "Rgxg2",
    "Kf4+",
    "N6c4",
    "Nbxc6",
    "Nexf5",
    "Ngxh3+",
    "Qxg7#",
    "R1f2+",
    "R1xa4",
    "R3xb2",
    "R4d2+",
    "R5g2",
    "R5h2",
    "R7g2",
    "R8h6+",
    "Rbxe8",
    "Rdxe5",
    "Rfb5",
    "Rfxg5+",
    "Rgxf8",
    "Rgxh4",
    "Rhxe5",
    "Rhxg1",
    "cxd7+",
    "N7xe5",
    "Ncd5+",
    "R1a4",
    "R1xd7+",
    "R2f6",
    "R6b3",
    "R6xc4",
    "Rag1+",
    "Rbg6",
    "Rcxb4",
    "Rcxe4",
    "Rcxf8",
    "Rea4",
    "Reg7+",
    "Rexb6",
    "N3xc4",
    "Ncxb4",
    "Nfd6+",
    "Nfg6+",
    "R1e6",
    "R2h5",
    "R4xe6",
    "R5e4+",
    "R6c5",
    "R7d2+",
    "R8xg5+",
    "Ra8#",
    "Raxd4",
    "Raxf3",
    "Rcg4",
    "Rcg8+",
    "Rcxe1+",
    "Rfg1+",
    "Rfxa5",
    "Rfxb2",
    "Rfxb6",
    "Rgf1+",
    "cxb8=Q",
    "Bxc1+",
    "Kh4+",
    "N6xd4",
    "Nexg3+",
    "Q8xd4",
    "R1xf3",
    "R3xd5",
    "R4h6",
    "R5f3+",
    "R5f7+",
    "R5xd6",
    "R7a4+",
    "R7f3",
    "R7f5",
    "R7f6+",
    "Rbxb6+",
    "Rcxb5",
    "Rcxc5+",
    "Rexc4",
    "Rfg7+",
    "Rgf5+",
    "Rgxh6",
    "fxg8=Q",
    "N3e5",
    "N5xd6",
    "Naxc3",
    "Ned3+",
    "R2a3+",
    "R4xf6",
    "R5xd4",
    "R6xf7",
    "R7xd6",
    "R8xh7",
    "Rbg6+",
    "Rbxd2",
    "Rbxe5",
    "Rcxb8",
    "Rdg2+",
    "Rdxe8",
    "Reh3",
    "Rfxg8",
    "Rga2",
    "hxg1=Q+",
    "N6e4",
    "Nbxd3",
    "Nfg5+",
    "R1h2+",
    "R2f4",
    "R2xb7",
    "R4e2+",
    "R4xc3",
    "R5xc6",
    "R6xc5",
    "R7f2+",
    "R8d5+",
    "R8g4",
    "Raf3+",
    "Rbe2+",
    "Rbh5",
    "Rde1+",
    "Rdxf2",
    "Rexb5",
    "Rexg5",
    "Rfa2",
    "Rgxf4+",
    "Rh1#",
    "Rhxd4",
    "bxc1=Q+",
    "Bxb8+",
    "N1a3",
    "Ncd6+",
    "Ncxb5+",
    "Nec6+",
    "Nhf6+",
    "Qh4#",
    "R1d5+",
    "R2g3",
    "R2g5",
    "R8g6+",
    "R8xa5",
    "Rch7",
    "Rcxc2+",
    "Rdf6+",
    "Rea6",
    "Reh2",
    "Rexf5",
    "Rfxa7",
    "Rfxe4+",
    "Rfxg3",
    "Rhxb2",
    "c1=R",
    "fxe1=Q",
    "N2f4+",
    "N4h5",
    "N8xc6+",
    "Nbd5+",
    "Ngxf6+",
    "R2xb4+",
    "R2xf3",
    "R7a2",
    "R8d4+",
    "Rbg2",
    "Rbh7",
    "Rbxa6",
    "Rdc8+",
    "Rdxe1",
    "Rfg3+",
    "Rhd1+",
    "Kd2+",
    "Kxb6+",
    "Kxc4+",
    "N2xg3+",
    "N4g6",
    "N6a4",
    "N6g4",
    "N7f5",
    "Qg1#",
    "R2b5",
    "R3xb4",
    "R3xf5",
    "R4g2",
    "R4g6+",
    "R4h5",
    "R6g2",
    "R8xg7",
    "Rab7+",
    "Rcxd3",
    "Rdxf8",
    "Rfe7+",
    "Rfxf7+",
    "exf8=R+",
    "N2xc3",
    "N3d5+",
    "N6f5+",
    "Ncxe8",
    "Ngf7+",
    "Ngxe5+",
    "Qe2#",
    "Qf8#",
    "Qh2#",
    "Qxg2#",
    "R1g7+",
    "R1xc2",
    "R2f7",
    "R3e7+",
    "R3xe7",
    "R7h3+",
    "R7xa5",
    "R8b7+",
    "R8g2",
    "R8xd2+",
    "Ra1#",
    "Rbd7+",
    "Rce8+",
    "Rcxf2",
    "Rdh4",
    "Rdxd3+",
    "Rexb4",
    "Rfb7+",
    "Rfxb8",
    "Rfxg7+",
    "Rfxh6",
    "Rh7#",
    "Bxe1+",
    "N1c2",
    "N4b6",
    "N4xc6",
    "Nbc4+",
    "Nbxd6+",
    "Nde4+",
    "Ndxe7",
    "Nexf3",
    "Nfd3+",
    "Ngxf8",
    "Nhxg7",
    "Qg5#",
    "R1f6",
    "R1xc4",
    "R6xd7",
    "R7d4+",
    "R7xe5",
    "R8c3+",
    "Raxc7+",
    "Rbg7",
    "Rcxf5",
    "Rexb7",
    "Rfxf2+",
    "Rgb2",
    "Rgxh2",
    "Rhc7",
    "Rhe6+",
    "Rhxb3",
    "Rhxd3",
    "bxa6+",
    "f1=N+",
    "gxh8=R+",
    "Kc2+",
    "Kd4+",
    "Kg7+",
    "N6xa5",
    "Nef5+",
    "Ngf5+",
    "Ngxe6+",
    "Qe7#",
    "R1d6+",
    "R4xf3",
    "R6f3+",
    "R6xa4",
    "R6xd4",
    "R7g3",
    "R8d2+",
    "R8xg3+",
    "Rbf6",
    "Rcxc1",
    "Rde8+",
    "Rfc6",
    "Rgxd5",
    "Rhxc3",
    "Rhxd8+",
    "fxe8=Q",
    "h8=R+",
    "Ke2+",
    "Kf8+",
    "N3b5",
    "N4xf3",
    "Ndxe8",
    "Qd7#",
    "Qg4#",
    "R1d7+",
    "R1f5",
    "R2xc4",
    "R2xh4",
    "R4f3+",
    "R4h2+",
    "R5d6+",
    "R7g5+",
    "R7xc6",
    "R8f3",
    "Rbxb8",
    "Rcf6",
    "Rdxd6+",
    "Re1#",
    "Rec7+",
    "Rexe8",
    "Rfxb3",
    "Rg8#",
    "Rhb4",
    "Rhxe6",
    "Rhxf8",
    "bxc7+",
    "Kb3+",
    "Kxg4+",
    "N3e4+",
    "N4d6",
    "N5xf6",
    "Nba7",
    "Nexc1",
    "Nexd3",
    "Nexf6+",
    "Nhg8",
    "Qa8#",
    "Qd8#",
    "Qg6#",
    "Qxh7#",
    "R2g3+",
    "R4xc5",
    "R7g5",
    "R7xf4",
    "R8c2+",
    "Rbc8+",
    "Rcf1+",
    "Rcf4",
    "Rcxb7",
    "Rdxd7+",
    "Rexf2",
    "Rexh6",
    "Rgxd4",
    "Rgxf6",
    "exd1=Q",
    "N4xb3",
    "Nab2",
    "Nac4+",
    "Naxb1",
    "Nge2+",
    "Nhxf2",
    "Qg8#",
    "R1b2+",
    "R1b7+",
    "R1c2+",
    "R1xa2",
    "R3xf7",
    "R6f5+",
    "Raxa1",
    "Raxf7",
    "Raxg4",
    "Rbxe1",
    "Rcd5+",
    "Rcxe2+",
    "Rd8#",
    "Rdxe3",
    "Rdxg2+",
    "Re8#",
    "Rf8#",
    "Rfxc3",
    "Rfxc6",
    "Rfxf5+",
    "Rgxf5+",
    "Rgxh7",
    "Rhxf5",
    "Rhxf6",
    "Rhxg4+",
    "exd8=Q",
    "fxg1=Q+",
    "Ba8+",
    "Kxd4+",
    "N3c2",
    "N3xe5",
    "N4f6",
    "N5xh4",
    "Naxb6",
    "Ncxb4+",
    "Nfxg3",
    "Q7xd4",
    "Qhf1+",
    "R1a3+",
    "R2g4",
    "R6f4",
    "R6g5+",
    "R7f3+",
    "Raf8+",
    "Raxc4",
    "Rbf5",
    "Rbf8+",
    "Rfa6",
    "Rge7+",
    "Rgxg3",
    "Rh3#",
    "Rhxd6",
    "axb1=N",
    "dxc1=Q",
    "Kb7+",
    "N2xf3",
    "N2xf4",
    "N3e5+",
    "N6a7",
    "N8xa6",
    "Nbxd6",
    "Ned5+",
    "Nfxh3+",
    "Q1g2",
    "Qd1#",
    "R1d3+",
    "R1f6+",
    "R1g2+",
    "R1h4+",
    "R5xe6",
    "R8g2+",
    "Raxc7",
    "Raxg7+",
    "Rd1#",
    "Rdxd2+",
    "Rdxf1+",
    "Rexf6",
    "Rga5",
    "N3xc5",
    "N6f7",
    "N8xc7",
    "Ncxe3+",
    "Neg2",
    "Nge6+",
    "Ngf2+",
    "Nhf3+",
    "Nxh1+",
    "Qbb7",
    "Qde7+",
    "Qe1#",
    "Qee4",
    "Qf1#",
    "Qf2#",
    "Qh5#",
    "Qxf7#",
    "R3g4",
    "R4xd7",
    "R4xf7+",
    "R6xc7",
    "R6xd3",
    "Raxg6+",
    "Rb1#",
    "Rbxe6",
    "Rcg6",
    "Rcxf7",
    "Rdg5",
    "Rdg7+",
    "Rexe7+",
    "Rf1#",
    "Rfg8+",
    "Rfxd2",
    "Rfxf6+",
    "Rgc3+",
    "Rgf6+",
    "Rgxe3",
    "Rgxf2+",
    "Rhe5",
    "Rhf7+",
    "gxh1=Q",
    "Kc3+",
    "Kf1+",
    "Kg4+",
    "N2e4+",
    "N5xa6",
    "N6g5+",
    "Ndxc2+",
    "Ndxe2+",
    "Nfxg2",
    "Ngh5+",
    "Qb6#",
    "Qe8#",
    "Qfe3+",
    "Qg3#",
    "Qh3#",
    "R1h4",
    "R1h7",
    "R2xd4",
    "R3d5+",
    "R3xg4",
    "R5a6",
    "R6d4+",
    "R6h5",
    "R7xe2",
    "R8xc5",
    "Raxf2",
    "Rc8#",
    "Rcg3+",
    "Rdxb7",
    "Rgb3",
    "Rhc5",
    "c8=R",
    "N5xg4",
    "Nce4+",
    "Nec5+",
    "Nexg2",
    "Nhg1",
    "Nhxf1",
    "Nxa1+",
    "Q7a2+",
    "Qxh2#",
    "R1b3+",
    "R1xc6",
    "R1xf4",
    "R6xh4",
    "R7xc5",
    "Rae2+",
    "Raxd6+",
    "Rbxc2+",
    "Rbxf2",
    "Red2+",
    "Red8+",
    "Rexh2",
    "Rfxa1",
    "Rhb6",
    "d1=R",
    "Kd7+",
    "N4e3",
    "N4f5",
    "N4g5+",
    "N5e6+",
    "Nca3",
    "Nce3+",
    "Ncxb6",
    "Ncxe5+",
    "Ned6+",
    "Nhxf7+",
    "Nhxg6",
    "Nhxg6+",
    "Q7f4",
    "Qae4",
    "Qc8#",
    "Qgf1",
    "Qh6#",
    "R1h6+",
    "R2a6+",
    "R3e4",
    "R3h4",
    "R4xd3",
    "R5h6",
    "R6a5+",
    "R7c2",
    "R7g6+",
    "R8xc6",
    "R8xe6",
    "Rab2+",
    "Rb8#",
    "Rbe6+",
    "Rcd3+",
    "Rcxa7",
    "Rdg3+",
    "Rdxb6",
    "Rdxg7+",
    "Rfxd3",
    "Rgxe2+",
    "Rgxf3",
    "Rhc1+",
    "Rhxf2",
    "Rhxh2+",
    "Rxf1#",
    "cxd1=Q+",
    "dxe1=Q",
    "N2f4",
    "N2g4",
    "N3xa4",
    "N3xd5",
    "N5h3",
    "Nbd6+",
    "Nbxc2",
    "Ndxb1",
    "Ndxf2",
    "Nfe5+",
    "Nfxd3",
    "Nfxe1",
    "Qb3#",
    "Qc7#",
    "Qd2#",
    "Qef6",
    "Qhh7+",
    "Qxf8#",
    "R1xd6",
    "R2b3+",
    "R3xe2",
    "R4b7+",
    "R5xe6+",
    "R6xd5",
    "R7g4",
    "Rac2+",
    "Rag3",
    "Raxc6+",
    "Rcxc6+",
    "Rdf5+",
    "Rdxf3",
    "Rfxd7",
    "Rfxe5",
    "Rga4",
    "Rgxe3+",
    "Rgxh5+",
    "Rha4",
    "Rhxh6",
    "d8=B",
    "N3h4+",
    "N3xe4",
    "Qa5#",
    "Qf6#",
    "R2h3+",
    "R3a4+",
    "R3g6",
    "R4a5+",
    "R4a6",
    "R5a6+",
    "R5xb6",
    "R5xg4",
    "R6xe7",
    "R8a6+",
    "Raxe7",
    "Raxf7+",
    "Rbxb7+",
    "Rcxg2",
    "Rdxa5",
    "Rec2+",
    "Rfd1+",
    "Rg1#",
    "Rgc1+",
    "Rhf2+",
    "Rhxc2",
    "Rhxe7",
    "Rhxh3",
    "e8=R",
    "Kh3+",
    "N2xg3",
    "Nac3+",
    "Ncxe6+",
    "Nfd5+",
    "Nhxf2+",
    "Nhxg2",
    "Qa1#",
    "Qad4",
    "Qb4#",
    "Qb8#",
    "Qbb2+",
    "Qdxe5",
    "R1xb5",
    "R1xd7",
    "R3f4+",
    "R3xf4",
    "R5f4+",
    "R7xb6",
    "R7xd5",
    "R8f7+",
    "R8h7+",
    "Raf4+",
    "Rag3+",
    "Raxf5+",
    "Raxf6+",
    "Rbd8+",
    "Rbxh4",
    "Rcxe2",
    "Ref6+",
    "Rfxe2+",
    "Rga7",
    "Rhe2+",
    "Rxe8#",
    "b8=R",
    "g8=N",
    "Bxb1+",
    "Kb2+",
    "Kxh4+",
    "N1g2",
    "N6h5+",
    "N7h5",
    "Na8+",
    "Naxb3",
    "Nec3+",
    "Nexg4+",
    "Nfe4+",
    "Nfxh5",
    "Nfxh6",
    "Ngh7+",
    "Qec1+",
    "Qxe1#",
    "R2xb5",
    "R2xc5",
    "R3xa4",
    "R4e7+",
    "R5b7+",
    "R5xe4",
    "R6e7+",
    "R8xf4",
    "Rah2",
    "Rbxe3",
    "Rc1#",
    "Rch6",
    "Rexg2",
    "Rexg4",
    "Rfc4",
    "Rgxh3",
    "Rh2#",
    "Rh6#",
    "Rhb2+",
    "Rhb7+",
    "Rhe3+",
    "Rhxb6+",
    "Rhxc1",
    "Rhxf4",
    "Rxf8#",
    "f1=R",
    "f8=N",
    "g5#",
    "Bf6#",
    "Kh1+",
    "Kh5+",
    "Kxg5+",
    "N2g4+",
    "N7d6",
    "Nexg6",
    "Nexg6+",
    "Nfxe5+",
    "Ngxh4",
    "Q4e6+",
    "Qa3#",
    "Qb1#",
    "Qbd1",
    "Qc1#",
    "Qc2#",
    "Qdd8+",
    "Qf5#",
    "Qxf2#",
    "R1f7+",
    "R3f6",
    "R3xe6+",
    "R5xc3",
    "R7a3",
    "R7b3+",
    "R7xe3",
    "R8h2",
    "Ra7#",
    "Rdb7+",
    "Rdc1+",
    "Rdxe4+",
    "Rexe3+",
    "Rexh3",
    "Rfxb7",
    "Rfxf8",
    "Rgf8+",
    "Rhxf7",
    "bxa1=Q+",
    "cxd1=R+",
    "e8=N+",
    "Ba1+",
    "Bf4#",
    "Kb5+",
    "Kxf2+",
    "N1xb3",
    "N6b4",
    "N6b5+",
    "Nbd1",
    "Ndxc8",
    "Ndxe6+",
    "Nxa8+",
    "Qa2#",
    "Qc5#",
    "Qe6#",
    "Qea5",
    "Qfd4+",
    "Qge3+",
    "Qgg2",
    "Qhg7",
    "Qxf1#",
    "Qxh5#",
    "Qxh6#",
    "R2e7",
    "R2f7+",
    "R6xb7",
    "Rag4",
    "Rbg1+",
    "Rcd8+",
    "Rde2+",
    "Rdf7+",
    "Re7#",
    "Reg8+",
    "Rgxg3+",
    "Rh5#",
    "Rxd8#",
    "axb1=Q+",
    "axb8=Q+",
    "b8=N",
    "exd1=Q+",
    "Kg6+",
    "Kh2+",
    "N6g4+",
    "Ndxf6+",
    "Ned8",
    "Nfg2",
    "Nhf2+",
    "Nxb1+",
    "Nxh8+",
    "Qb5#",
    "Qbb7+",
    "Qd5#",
    "Qdb2+",
    "Qe3#",
    "Qf3#",
    "Qf4#",
    "Qfd2",
    "Qge7+",
    "Qgh7",
    "Qxd1#",
    "Qxh3#",
    "R2xa4",
    "R3xg2",
    "R4xa5",
    "R5h3+",
    "R8c5+",
    "R8g3+",
    "Rab1+",
    "Rag2",
    "Raxc2",
    "Rbf7+",
    "Rbg8+",
    "Rd5#",
    "Rdxa2",
    "Rdxg5",
    "Reb1+",
    "Reh5",
    "Rexf3+",
    "Rexf8",
    "Rexg3",
    "Rexh7",
    "Rfxc2+",
    "Rga6",
    "Rgb7+",
    "Rgb8+",
    "Rhc8+",
    "Rhxd2",
    "Rhxg3",
    "Rxe1#",
    "Rxh3#",
    "Rxh7#",
    "bxa8=Q+",
    "bxa8=R+",
    "cxd8=R",
    "exf8=Q",
    "gxh8=Q+",
    "Be5#",
    "Ka6+",
    "N1xg3",
    "N5xe6",
    "N6xb5",
    "Naxb2",
    "Nce7+",
    "Ndf5+",
    "Ndxc1",
    "Nexd4+",
    "Nf3#",
    "Nge5+",
    "Nhxf5+",
    "Q6f6+",
    "Qa6#",
    "Qae1+",
    "Qc3#",
    "Qc6#",
    "Qcc3+",
    "Qde2+",
    "Qe5#",
    "Qeg7+",
    "Qfe1+",
    "Qfe2",
    "Qfe6",
    "Qgb8+",
    "Qhe1+",
    "Qxb2#",
    "Qxe7#",
    "Qxe8#",
    "Qxf3#",
    "Qxg3#",
    "Qxg6#",
    "R1a7+",
    "R2d7+",
    "R2xe4",
    "R3g6+",
    "R3g7",
    "R4b6+",
    "R5xa4",
    "R7b2+",
    "R8xg5",
    "Ra3#",
    "Raxa5",
    "Raxd3+",
    "Rce7+",
    "Rcf2+",
    "Rcxf3",
    "Rd6#",
    "Rdb1+",
    "Rdxf7+",
    "Rdxh3+",
    "Re2#",
    "Reg1+",
    "Rexg2+",
    "Rexg7+",
    "Rf2#",
    "Rf5#",
    "Rfb2+",
    "Rfe2+",
    "Rfe3+",
    "Rfxg8+",
    "Rgxg7+",
    "Rh4#",
    "Rhf5+",
    "Rhxh5+",
    "Rxh2#",
    "Rxh4#",
    "Rxh5#",
    "a1=N",
    "bxc1=Q",
    "d1=N+",
    "d8=B+",
    "d8=R",
    "exf1=R",
    "f8=N+",
    "g3#",
    "h1=B",
    "h8=B",
    "Bc6#",
    "Be2#",
    "Bg3#",
    "Bg7#",
    "Bxg8+",
    "Kb1+",
    "Kc7+",
    "Kh8+",
    "N1e3",
    "N1g2+",
    "N4e6",
    "Nc7#",
    "Nde1",
    "Ndxe5+",
    "Ne5#",
    "Nf6#",
    "Nf7#",
    "Nfxg6+",
    "Ngxf3+",
    "Q2d2+",
    "Q4d4+",
    "Q7d7+",
    "Q8f8+",
    "Qa4#",
    "Qab7",
    "Qae5+",
    "Qaf1",
    "Qbd3+",
    "Qbe2+",
    "Qbf4+",
    "Qcd7+",
    "Qcf1",
    "Qd6#",
    "Qdd4+",
    "Qde7",
    "Qe4#",
    "Qeb4+",
    "Qfc5+",
    "Qfd8+",
    "Qge5+",
    "Qgg3+",
    "Qxc2#",
    "Qxc7#",
    "Qxd8#",
    "R2b4",
    "R2b5+",
    "R2g7",
    "R2xe3",
    "R2xe5",
    "R3g5",
    "R5g4",
    "R5g4+",
    "R5h7+",
    "R5xf2",
    "R7e2+",
    "R7xa6",
    "R7xf5",
    "R8f3+",
    "R8h3",
    "R8xa3",
    "R8xb6",
    "R8xf3",
    "R8xf5+",
    "R8xf6",
    "Ra6#",
    "Rah5",
    "Raxg2",
    "Rbe7+",
    "Rbxh6",
    "Rde6+",
    "Re3#",
    "Reb3+",
    "Rgxd1",
    "Rgxg4",
    "Rhxb4",
    "Rxd1#",
    "Rxf6#",
    "Rxg1#",
    "bxa7+",
    "cxb1=Q+",
    "f8=Q#",
    "g4#",
    "h1=Q#",
    "Bf3#",
    "Bf5#",
    "Bf7#",
    "Bg4#",
    "Bxf6#",
    "Kf2+",
    "Kxc5+",
    "N5e6",
    "N7xf5",
    "Nbc6+",
    "Nc4#",
    "Nde7+",
    "Ndxc7",
    "Ndxf1",
    "Ned4+",
    "Nf5#",
    "Ng6#",
    "Nh6#",
    "Nhg5+",
    "Nhg6+",
    "Nxb8+",
    "Q1f1+",
    "Q4g1+",
    "Q8a3",
    "Qa7#",
    "Qaa6+",
    "Qab8+",
    "Qad1",
    "Qaxb8",
    "Qba7+",
    "Qbb4+",
    "Qce1",
    "Qdd5+",
    "Qdf2+",
    "Qdg4+",
    "Qed4",
    "Qee7+",
    "Qfd1+",
    "Qff2+",
    "Qgc7+",
    "Qgd1",
    "Qgd2+",
    "Qge8+",
    "Qgf3",
    "Qhc1+",
    "Qhh4+",
    "Qxb7#",
    "Qxe6#",
    "Qxg4#",
    "Qxg5#",
    "R2a5",
    "R2xb3+",
    "R3d4+",
    "R3f6+",
    "R4c6+",
    "R5b4",
    "R8a3+",
    "R8xf5",
    "R8xh7+",
    "Ra5#",
    "Rad6+",
    "Rbc2+",
    "Rbxd2+",
    "Rch4",
    "Rcxc4+",
    "Rcxd6+",
    "Rdxb1",
    "Rfxg3+",
    "Rg4#",
    "Rge3+",
    "Rhxe2+",
    "Rxb1#",
    "Rxe6#",
    "Rxf7#",
    "d8=Q#",
    "dxe8=Q",
    "e1=Q#",
    "f1=R+",
    "f4#",
    "fxg1=Q",
    "g8=R",
    "gxh8=Q",
    "h6#",
    "Be3#",
    "Be6#",
    "Bg2#",
    "Bg6#",
    "Bxe5#",
    "Bxe8+",
    "N3f4+",
    "Nbc2+",
    "Nd6#",
    "Ne2#",
    "Ne7#",
    "Nf2#",
    "Nfd2+",
    "Nfh6+",
    "Nfxg7",
    "Ng3#",
    "Ng4#",
    "Nge7+",
    "Nxf7#",
    "Q8e5",
    "Qaa4+",
    "Qac3",
    "Qac3+",
    "Qad4+",
    "Qad8+",
    "Qbe5",
    "Qbf7",
    "Qbxb6+",
    "Qc4#",
    "Qca1#",
    "Qcc1+",
    "Qcc2",
    "Qcc7",
    "Qcd1+",
    "Qcd8",
    "Qcd8+",
    "Qce3",
    "Qcf5+",
    "Qcf7",
    "Qdb2",
